[["0",{"pageContent":"Pond Hockey Club is a community-based hockey club.\r\nYou can join PHC by registering on the website.","metadata":{"source":"faqs.txt","loc":{"lines":{"from":1,"to":2}}}}],["1",{"pageContent":"What is Pond Hockey Club?\r\nPond Hockey Club (PHC) is an elite hockey training facility for kids and teens, focused on building tomorrow's stars through comprehensive development in hockey skills, education, health, and character.\r\n\r\nWhere is Pond Hockey Club located?\r\nPond Hockey Club is located at 555 Pleasantville Rd STE 200, Briarcliff Manor, NY 10510.\r\n\r\nHow can I contact Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":1,"to":7}}}}],["2",{"pageContent":"How can I contact Pond Hockey Club?\r\nYou can contact Pond Hockey Club by emailing info@thepondhockeyclub.com or calling their office. You can also follow them on Instagram @the_pond_hockey_club.\r\n\r\nWhat is the website for Pond Hockey Club?\r\nThe website is https://pond-hockey-club.vercel.app/\r\n\r\nWhat is the philosophy behind Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":7,"to":13}}}}],["3",{"pageContent":"What is the philosophy behind Pond Hockey Club?\r\nPond Hockey Club believes in maximizing repetitions and building grit through consistent practice. They leverage an always-available synthetic ice surface to transform limited training time into real, measurable development, following the principle that players should maximize practice time rather than waiting for limited ice availability.\r\n\r\nWhat is the John Mariucci quote that represents the club's philosophy?","metadata":{"source":"new.txt","loc":{"lines":{"from":13,"to":16}}}}],["4",{"pageContent":"\"There are too many one-hour players. They're waiting for one hour of indoor ice when they could use the natural ice God has given them for five or six hours.\" — John Mariucci, Minnesota Gopher Player & Coach\r\n\r\nWhat is the mission of Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":17,"to":19}}}}],["5",{"pageContent":"What is the mission of Pond Hockey Club?\r\nThe mission is to develop elite hockey skills while building resilience, character, and a genuine love for the game. They focus on creating well-rounded athletes who understand that greatness comes through dedication, repetition, and mental toughness.\r\n\r\nWhat are the core values of Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":19,"to":22}}}}],["6",{"pageContent":"What are the core values of Pond Hockey Club?\r\nThe four core values are: Hockey (elite skill development), Education (learning and mental development), Health (physical fitness and well-being), and Character (building resilience, discipline, and mental toughness).\r\n\r\nHow many players are in each training group?\r\nTraining groups are kept small, typically 4-6 players per session, to ensure personalized attention and maximum ice touches for every athlete.","metadata":{"source":"new.txt","loc":{"lines":{"from":22,"to":26}}}}],["7",{"pageContent":"What type of ice surface does Pond Hockey Club use?\r\nPond Hockey Club uses a synthetic ice surface that is always available for training, not dependent on traditional ice time schedules.\r\n\r\nWhat is the training approach at Pond Hockey Club?\r\nThe training approach centers on high-repetition training with structured drills, game-like scenarios, and continuous feedback. Sessions are designed to push players beyond their comfort zones while building confidence one repetition at a time.","metadata":{"source":"new.txt","loc":{"lines":{"from":28,"to":32}}}}],["8",{"pageContent":"How do I get started with Pond Hockey Club?\r\nThere are three steps: 1) Complete the safety waiver, 2) Book a free trial class to experience the training firsthand, 3) Select a membership plan that fits your goals and schedule.\r\n\r\nCan I try a class before committing to membership?\r\nYes, Pond Hockey Club offers a free trial class so you can experience their training approach, facility, and methodology before committing to a membership.\r\n\r\nWho is Pond Hockey Club designed for?","metadata":{"source":"new.txt","loc":{"lines":{"from":34,"to":40}}}}],["9",{"pageContent":"Who is Pond Hockey Club designed for?\r\nPond Hockey Club is designed for kids and teens interested in hockey development, players seeking elite-level training, athletes looking for small-group personalized coaching, and families seeking comprehensive athletic development.\r\n\r\nWhat makes Pond Hockey Club different from other hockey training facilities?","metadata":{"source":"new.txt","loc":{"lines":{"from":40,"to":43}}}}],["10",{"pageContent":"Key differentiators include: high-repetition training model, always-available synthetic ice surface, small group sizes (4-6 players), holistic development approach (hockey, education, health, character), emphasis on mental toughness, and clear progress tracking.\r\n\r\nDo you focus only on hockey skills?\r\nNo, Pond Hockey Club takes a holistic approach focusing equally on hockey skills, education, health, and character building to create well-rounded athletes.","metadata":{"source":"new.txt","loc":{"lines":{"from":44,"to":47}}}}],["11",{"pageContent":"What kind of feedback and progress tracking is provided?\r\nPlayers receive continuous feedback during sessions and have clear visibility into their development and achievement. Every player knows exactly where they stand and where they're headed.\r\n\r\nWhat pages are available on the Pond Hockey Club website?\r\nThe website includes: Home, Waiver & Safety, Schedule, Memberships, Contact, Coaches, Coaches Membership, and Special Events pages.\r\n\r\nWhere can I find membership pricing?","metadata":{"source":"new.txt","loc":{"lines":{"from":49,"to":55}}}}],["12",{"pageContent":"Where can I find membership pricing?\r\nSpecific membership pricing and plans are available on the Memberships page of the website at https://pond-hockey-club.vercel.app/memberships\r\n\r\nWhere can I find the training schedule?\r\nThe training schedule and booking details are available on the Schedule page at https://pond-hockey-club.vercel.app/schedule\r\n\r\nWhere can I find information about the coaches?","metadata":{"source":"new.txt","loc":{"lines":{"from":55,"to":61}}}}],["13",{"pageContent":"Where can I find information about the coaches?\r\nCoach profiles and credentials are available on the Coaches page at https://pond-hockey-club.vercel.app/coaches\r\n\r\nWhat is the waiver requirement?\r\nAll participants must sign a safety waiver to ensure a secure training environment. This is a standard requirement and details are available on the Waiver & Safety page.\r\n\r\nAre there special events at Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":61,"to":67}}}}],["14",{"pageContent":"Are there special events at Pond Hockey Club?\r\nYes, Pond Hockey Club offers special events including tournaments, camps, and special training events. Details can be found on the Special Events page.\r\n\r\nIs there a membership option for coaches?\r\nYes, there is a special Coaches Membership option. Details are available on the Coaches Membership page at https://pond-hockey-club.vercel.app/coaches-membership\r\n\r\nWhat is the advantage of synthetic ice?","metadata":{"source":"new.txt","loc":{"lines":{"from":67,"to":73}}}}],["15",{"pageContent":"What is the advantage of synthetic ice?\r\nSynthetic ice allows for consistent, flexible training schedules with always-available practice time, eliminating the need to wait for limited traditional ice time slots.\r\n\r\nHow does the small group size benefit players?\r\nSmall groups of 4-6 players ensure individual attention from coaches and maximize the number of ice touches each player gets during training sessions.\r\n\r\nWhat is meant by high-repetition training?","metadata":{"source":"new.txt","loc":{"lines":{"from":73,"to":79}}}}],["16",{"pageContent":"What is meant by high-repetition training?\r\nHigh-repetition training means maximizing the number of practice reps and drills each player completes, leading to faster skill development and muscle memory compared to traditional limited ice time.\r\n\r\nHow does Pond Hockey Club build mental toughness?\r\nTraining sessions are designed to push players beyond their comfort zones through consistent challenges, helping them discover their potential and develop the resilience needed for excellence.","metadata":{"source":"new.txt","loc":{"lines":{"from":79,"to":83}}}}],["17",{"pageContent":"Can I follow Pond Hockey Club on social media?\r\nYes, you can follow Pond Hockey Club on Instagram at @the_pond_hockey_club\r\n\r\nWhat is the club's approach to character development?\r\nCharacter development focuses on building resilience, discipline, dedication, and understanding that greatness comes through consistent effort and mental toughness, both on and off the ice.\r\n\r\nHow do I book a trial class?","metadata":{"source":"new.txt","loc":{"lines":{"from":85,"to":91}}}}],["18",{"pageContent":"How do I book a trial class?\r\nYou can book a trial class through the Schedule page on the website or by contacting the club directly at info@thepondhockeyclub.com\r\n\r\nWhat happens during a trial class?\r\nDuring a trial class, you experience the training firsthand and see the coaching approach, facility, and training methodology that Pond Hockey Club offers.\r\n\r\nIs the trial class free?\r\nYes, Pond Hockey Club offers a free trial class to prospective members.","metadata":{"source":"new.txt","loc":{"lines":{"from":91,"to":98}}}}],["19",{"pageContent":"What does \"Building Tomorrow's Stars\" mean?\r\nIt represents the club's commitment to developing young athletes into elite hockey players through comprehensive training in skills, mental toughness, character, and overall athletic development.\r\n\r\nWhat age groups does Pond Hockey Club serve?\r\nPond Hockey Club serves kids and teens, though specific age ranges should be confirmed by contacting the club directly.\r\n\r\nHow is progress measured?","metadata":{"source":"new.txt","loc":{"lines":{"from":100,"to":106}}}}],["20",{"pageContent":"How is progress measured?\r\nProgress is measured through structured assessments, continuous feedback from coaches, and tracking specific skill improvements over time. Players have clear visibility into their development.\r\n\r\nWhat kind of drills are used in training?\r\nTraining includes structured drills and game-like scenarios designed to maximize skill development, though specific drill details would be best discussed during a trial class.\r\n\r\nCan parents watch the training sessions?","metadata":{"source":"new.txt","loc":{"lines":{"from":106,"to":112}}}}],["21",{"pageContent":"Can parents watch the training sessions?\r\nThis information is not specified on the main website. Please contact the club directly for their observation and visitor policies.\r\n\r\nWhat equipment do I need?\r\nEquipment requirements are not detailed on the main website. Please contact the club at info@thepondhockeyclub.com for a complete equipment list.\r\n\r\nAre there different membership levels?","metadata":{"source":"new.txt","loc":{"lines":{"from":112,"to":118}}}}],["22",{"pageContent":"Are there different membership levels?\r\nYes, multiple membership options are available to accommodate different needs and commitment levels. Specific details are on the Memberships page.\r\n\r\nHow do I contact the club with specific questions?\r\nEmail info@thepondhockeyclub.com or visit the Contact page on the website for more ways to reach out.\r\n\r\nWhat is the copyright year shown on the website?\r\n© 2026 Pond Hockey Club. All rights reserved.","metadata":{"source":"new.txt","loc":{"lines":{"from":118,"to":125}}}}],["23",{"pageContent":"© 2026 Pond Hockey Club. All rights reserved.\r\n\r\nDoes Pond Hockey Club offer competitive team opportunities?\r\nThis information is not detailed on the main website. Please check the website's pages or contact the club directly for information about competitive teams or leagues.\r\n\r\nWhat is the coaching philosophy?","metadata":{"source":"new.txt","loc":{"lines":{"from":125,"to":130}}}}],["24",{"pageContent":"What is the coaching philosophy?\r\nThe coaching philosophy emphasizes maximizing repetitions, building grit through consistency, personalized attention in small groups, continuous feedback, and pushing players to discover their potential through dedicated practice.\r\n\r\nHow often are training sessions held?\r\nSpecific scheduling information is available on the Schedule page at https://pond-hockey-club.vercel.app/schedule\r\n\r\nCan I get information about camps and tournaments?","metadata":{"source":"new.txt","loc":{"lines":{"from":130,"to":136}}}}],["25",{"pageContent":"Yes, information about camps, tournaments, and other special events is available on the Special Events page of the website.\r\n\r\nWhat makes the coaching staff qualified?\r\nInformation about coach profiles, credentials, and expertise is available on the Coaches page at https://pond-hockey-club.vercel.app/coaches\r\n\r\nIs there a commitment period for memberships?\r\nSpecific membership terms and commitment periods are detailed on the Memberships page. Contact the club for more information.","metadata":{"source":"new.txt","loc":{"lines":{"from":137,"to":143}}}}],["26",{"pageContent":"How do I know if Pond Hockey Club is right for my child?\r\nThe best way is to book a free trial class to experience the training approach firsthand and see if it aligns with your child's goals and learning style.\r\n\r\nWhat happens after I complete the waiver?\r\nAfter completing the waiver, you can book a trial class to experience the training, and then select a membership plan if you decide to join.\r\n\r\nDoes Pond Hockey Club focus on individual skills or team play?","metadata":{"source":"new.txt","loc":{"lines":{"from":145,"to":151}}}}],["27",{"pageContent":"Based on the information available, the club focuses on individual skill development in small groups, with game-like scenarios included in training. For more details, contact the club directly.\r\n\r\nWhat is the training environment like?\r\nThe training environment features small groups (4-6 players), personalized coaching, an always-available synthetic ice surface, and a focus on pushing players beyond their comfort zones in a supportive setting.\r\n\r\nAre there any prerequisites to join?","metadata":{"source":"new.txt","loc":{"lines":{"from":152,"to":157}}}}],["28",{"pageContent":"Are there any prerequisites to join?\r\nThe main requirement is completing the safety waiver. Specific skill level requirements or age restrictions should be confirmed by contacting the club directly.\r\n\r\nCan I visit the facility before signing up?\r\nThe free trial class is the best way to visit the facility and experience the training environment. Contact the club to arrange a trial or tour.\r\n\r\nWhat is included in the membership?","metadata":{"source":"new.txt","loc":{"lines":{"from":157,"to":163}}}}],["29",{"pageContent":"What is included in the membership?\r\nSpecific membership benefits and what's included are detailed on the Memberships page at https://pond-hockey-club.vercel.app/memberships\r\n\r\nHow does Pond Hockey Club incorporate education into training?\r\nEducation is one of the four core values, representing the focus on learning and mental development alongside athletic training, helping create well-rounded athletes.\r\n\r\nWhat does the health pillar include?","metadata":{"source":"new.txt","loc":{"lines":{"from":163,"to":169}}}}],["30",{"pageContent":"What does the health pillar include?\r\nThe health pillar focuses on physical fitness and overall well-being as part of the comprehensive development approach.\r\n\r\nHow can I stay updated on Pond Hockey Club news?\r\nFollow them on Instagram @the_pond_hockey_club or check their website regularly for updates on events, schedules, and announcements.\r\n\r\nIs financial aid or payment plans available?","metadata":{"source":"new.txt","loc":{"lines":{"from":169,"to":175}}}}],["31",{"pageContent":"Is financial aid or payment plans available?\r\nThis information is not specified on the main website. Please contact the club directly at info@thepondhockeyclub.com to inquire about payment options.\r\n\r\nWhat is the cancellation policy?\r\nCancellation policies are not detailed on the main website. Please check the Memberships page or contact the club for their terms and conditions.\r\n\r\nCan siblings train together?","metadata":{"source":"new.txt","loc":{"lines":{"from":175,"to":181}}}}],["32",{"pageContent":"Can siblings train together?\r\nThis would depend on age groups and scheduling. Contact the club directly to discuss training options for multiple family members.\r\n\r\nWhat safety measures are in place?\r\nAll participants must complete a safety waiver. Additional safety measures and policies are detailed on the Waiver & Safety page of the website.\r\n\r\nHow experienced are the coaches?","metadata":{"source":"new.txt","loc":{"lines":{"from":181,"to":187}}}}],["33",{"pageContent":"How experienced are the coaches?\r\nCoach profiles, credentials, and experience are available on the Coaches page at https://pond-hockey-club.vercel.app/coaches\r\n\r\nDoes Pond Hockey Club offer private lessons?\r\nThis information is not specified on the main website. Contact the club to inquire about private training options.\r\n\r\nWhat is the typical duration of a training session?","metadata":{"source":"new.txt","loc":{"lines":{"from":187,"to":193}}}}],["34",{"pageContent":"Session duration is not specified on the main website. Check the Schedule page or contact the club for details on session length.\r\n\r\nAre there seasonal programs or year-round training?\r\nThis information is not detailed on the main website. Contact the club to learn about their training calendar and seasonal offerings.\r\n\r\nHow do I change or cancel my membership?","metadata":{"source":"new.txt","loc":{"lines":{"from":194,"to":199}}}}],["35",{"pageContent":"How do I change or cancel my membership?\r\nMembership change and cancellation policies should be detailed in the membership terms. Contact the club directly for assistance with membership modifications.\r\n\r\nWhat payment methods are accepted?\r\nAccepted payment methods are not specified on the main website. Contact the club at info@thepondhockeyclub.com to inquire about payment options.\r\n\r\nIs there a referral program?","metadata":{"source":"new.txt","loc":{"lines":{"from":199,"to":205}}}}],["36",{"pageContent":"Is there a referral program?\r\nThis information is not available on the main website. Contact the club to ask about referral programs or member benefits.\r\n\r\nWhat happens if I miss a session?\r\nMake-up policies and session flexibility are not detailed on the main website. Contact the club for their attendance and make-up session policies.\r\n\r\nCan I upgrade or downgrade my membership?","metadata":{"source":"new.txt","loc":{"lines":{"from":205,"to":211}}}}],["37",{"pageContent":"Can I upgrade or downgrade my membership?\r\nMembership change options should be discussed with the club directly. Contact them at info@thepondhockeyclub.com for information about modifying your membership.\r\n\r\nAre there any additional fees beyond membership?\r\nAdditional fees, if any, should be detailed on the Memberships page or in the membership terms. Contact the club for a complete breakdown of costs.\r\n\r\nWhat is the student-to-coach ratio?","metadata":{"source":"new.txt","loc":{"lines":{"from":211,"to":217}}}}],["38",{"pageContent":"What is the student-to-coach ratio?\r\nTraining groups are typically 4-6 players per session, ensuring personalized attention from the coaching staff.\r\n\r\nDoes Pond Hockey Club host tournaments?\r\nInformation about tournaments and competitive events is available on the Special Events page at https://pond-hockey-club.vercel.app/special-events\r\n\r\nHow do I provide feedback about my experience?\r\nContact the club directly at info@thepondhockeyclub.com to share feedback or discuss your experience.","metadata":{"source":"new.txt","loc":{"lines":{"from":217,"to":224}}}}],["39",{"pageContent":"Is there a waiting list to join?\r\nThis information is not available on the main website. Contact the club to inquire about current availability and any waiting lists.\r\n\r\nWhat is the best way to prepare for the trial class?\r\nContact the club before your trial to confirm what equipment to bring and any other preparation needed. They'll ensure you're ready for the session.\r\n\r\nCan I speak with other parents or current members?","metadata":{"source":"new.txt","loc":{"lines":{"from":226,"to":232}}}}],["40",{"pageContent":"This option is not mentioned on the website, but you could request testimonials or parent references by contacting the club directly.\r\n\r\nHow long has Pond Hockey Club been operating?\r\nThe founding date is not specified on the main website. Contact the club for information about their history and experience.\r\n\r\nDoes the club participate in any leagues or competitions?","metadata":{"source":"new.txt","loc":{"lines":{"from":233,"to":238}}}}],["41",{"pageContent":"Information about league participation and competitive opportunities may be available on the Special Events page or by contacting the club directly.\r\n\r\nWhat is the refund policy?\r\nRefund policies are not detailed on the main website. Review the membership terms or contact the club at info@thepondhockeyclub.com for their refund policy.\r\n\r\nAre there family discounts available?","metadata":{"source":"new.txt","loc":{"lines":{"from":239,"to":244}}}}],["42",{"pageContent":"Are there family discounts available?\r\nFamily discount information is not specified on the main website. Contact the club to inquire about multi-member or family pricing options.\r\n\r\nWhat is the coach-to-player communication like?\r\nWith small groups of 4-6 players, coaches provide continuous feedback during sessions. For details on communication outside of sessions, contact the club.\r\n\r\nCan I pause my membership?","metadata":{"source":"new.txt","loc":{"lines":{"from":244,"to":250}}}}],["43",{"pageContent":"Can I pause my membership?\r\nMembership pause options are not detailed on the main website. Contact the club directly to discuss membership flexibility and pause policies.\r\n\r\nWhat makes the training \"elite\"?\r\nThe elite designation comes from the high-repetition model, small group sizes, personalized attention, continuous feedback, synthetic ice availability, and comprehensive focus on skills, character, and mental toughness.\r\n\r\nHow quickly can I see progress?","metadata":{"source":"new.txt","loc":{"lines":{"from":250,"to":256}}}}],["44",{"pageContent":"How quickly can I see progress?\r\nProgress varies by individual, but the high-repetition training model and consistent practice schedule are designed to deliver measurable improvements. Coaches provide regular feedback on development.\r\n\r\nIs there a minimum age requirement?\r\nSpecific age requirements are not listed on the main website. Contact the club directly to confirm age ranges for participation.\r\n\r\nWhat if my child is a beginner?","metadata":{"source":"new.txt","loc":{"lines":{"from":256,"to":262}}}}],["45",{"pageContent":"What if my child is a beginner?\r\nThe club serves players at various skill levels. Contact them to discuss whether they offer beginner programs and how they accommodate different skill levels in their small group format.\r\n\r\nAre there advanced or elite-level programs?\r\nGiven the focus on elite training, there may be advanced programs. Contact the club or check the Memberships page for different program levels.\r\n\r\nWhat is the training frequency recommended?","metadata":{"source":"new.txt","loc":{"lines":{"from":262,"to":268}}}}],["46",{"pageContent":"What is the training frequency recommended?\r\nRecommended training frequency is not specified on the main website. This would likely depend on the membership plan and individual goals. Check the Schedule and Memberships pages for details.\r\n\r\nDoes Pond Hockey Club offer goalie training?\r\nGoalie-specific training is not mentioned on the main website. Contact the club to inquire about specialized training for goalies.\r\n\r\nWhat are the benefits of synthetic ice vs. real ice?","metadata":{"source":"new.txt","loc":{"lines":{"from":268,"to":274}}}}],["47",{"pageContent":"Synthetic ice offers always-available practice time, consistent scheduling, no weather dependencies, and the ability to maximize repetitions without waiting for limited ice time slots.\r\n\r\nCan I tour the facility without booking a trial?\r\nThe website emphasizes the free trial class as the way to experience the facility. Contact the club to ask about facility tours.\r\n\r\nWhat credentials should I look for in the coaches?","metadata":{"source":"new.txt","loc":{"lines":{"from":275,"to":280}}}}],["48",{"pageContent":"Coach credentials, experience, and qualifications are detailed on the Coaches page at https://pond-hockey-club.vercel.app/coaches\r\n\r\nHow does Pond Hockey Club handle different skill levels in small groups?\r\nSpecific grouping strategies are not detailed. The small group size (4-6 players) suggests players may be grouped by skill level. Contact the club for details.\r\n\r\nIs there a dress code for training?","metadata":{"source":"new.txt","loc":{"lines":{"from":281,"to":286}}}}],["49",{"pageContent":"Is there a dress code for training?\r\nEquipment and attire requirements are not specified on the main website. Contact the club at info@thepondhockeyclub.com for what to wear and bring.\r\n\r\nWhat happens in a typical training session?\r\nSessions include structured drills, game-like scenarios, and continuous feedback, with focus on maximizing repetitions and individual skill development in small groups.\r\n\r\nCan I switch between different programs or times?","metadata":{"source":"new.txt","loc":{"lines":{"from":286,"to":292}}}}],["50",{"pageContent":"Scheduling flexibility is not detailed on the main website. Contact the club to discuss options for changing programs or session times.\r\n\r\nWhat is the check-in process for sessions?\r\nCheck-in procedures are not specified. This information would be provided when you join or during your trial class.\r\n\r\nAre parents required to stay during sessions?\r\nParent requirements during sessions are not specified. Contact the club for their policies regarding parent attendance.","metadata":{"source":"new.txt","loc":{"lines":{"from":293,"to":299}}}}],["51",{"pageContent":"What is the club's approach to injuries?\r\nInjury policies and procedures are not detailed on the main website. This would be covered in the safety waiver and club policies.\r\n\r\nDoes Pond Hockey Club offer off-ice training?\r\nOff-ice training is not mentioned on the main website. Contact the club to inquire about comprehensive training options beyond on-ice work.\r\n\r\nHow do I update my contact information?","metadata":{"source":"new.txt","loc":{"lines":{"from":301,"to":307}}}}],["52",{"pageContent":"How do I update my contact information?\r\nContact the club directly at info@thepondhockeyclub.com to update your contact details or account information.\r\n\r\nWhat is the maximum group size?\r\nGroups are typically 4-6 players per session, ensuring small group sizes for personalized attention.\r\n\r\nCan I request a specific coach?\r\nCoach assignment policies are not specified. Contact the club to discuss any preferences or requests regarding coaching staff.\r\n\r\nWhat is included in the safety waiver?","metadata":{"source":"new.txt","loc":{"lines":{"from":307,"to":316}}}}],["53",{"pageContent":"What is included in the safety waiver?\r\nDetailed waiver terms and conditions are available on the Waiver & Safety page at https://pond-hockey-club.vercel.app/waiver-safety\r\n\r\nHow do I know which membership is right for me?\r\nThe free trial class can help you understand the training and determine which membership fits your goals. The Memberships page provides plan details, and staff can help guide your decision.\r\n\r\nIs there a mobile app for Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":316,"to":322}}}}],["54",{"pageContent":"Is there a mobile app for Pond Hockey Club?\r\nA mobile app is not mentioned on the website. Contact the club for information about how to manage your membership and bookings.\r\n\r\nWhat are the parking arrangements at the facility?\r\nParking information is not provided on the main website. Contact the club or check during your trial class visit.\r\n\r\nCan I bring a friend to a trial class?","metadata":{"source":"new.txt","loc":{"lines":{"from":322,"to":328}}}}],["55",{"pageContent":"Can I bring a friend to a trial class?\r\nGuest policies for trial classes are not specified. Contact the club to ask about bringing a friend or sibling to try a class.\r\n\r\nHow far in advance should I book sessions?\r\nBooking timelines are not specified on the main website. The Schedule page likely provides booking information and availability.\r\n\r\nWhat is the instructor certification process?","metadata":{"source":"new.txt","loc":{"lines":{"from":328,"to":334}}}}],["56",{"pageContent":"What is the instructor certification process?\r\nCoach certifications and qualifications are detailed on the Coaches page at https://pond-hockey-club.vercel.app/coaches\r\n\r\nDoes Pond Hockey Club offer summer camps?\r\nSummer camp information may be available on the Special Events page at https://pond-hockey-club.vercel.app/special-events or by contacting the club.\r\n\r\nWhat is the policy on make-up sessions?","metadata":{"source":"new.txt","loc":{"lines":{"from":334,"to":340}}}}],["57",{"pageContent":"What is the policy on make-up sessions?\r\nMake-up session policies are not detailed on the main website. Contact the club directly for their policies on missed sessions.\r\n\r\nHow does billing work for memberships?\r\nBilling details and payment schedules are not specified. This information should be available on the Memberships page or by contacting the club.\r\n\r\nCan I freeze my membership temporarily?","metadata":{"source":"new.txt","loc":{"lines":{"from":340,"to":346}}}}],["58",{"pageContent":"Can I freeze my membership temporarily?\r\nMembership freeze options are not mentioned on the website. Contact the club at info@thepondhockeyclub.com to discuss temporary holds.\r\n\r\nWhat equipment does the facility provide?\r\nWhat's provided by the facility versus what players need to bring is not specified. Contact the club for a complete list of required and provided equipment.\r\n\r\nAre there testimonials from other families?","metadata":{"source":"new.txt","loc":{"lines":{"from":346,"to":352}}}}],["59",{"pageContent":"Are there testimonials from other families?\r\nTestimonials are not displayed on the main website. You could request references or testimonials by contacting the club directly.\r\n\r\nHow does Pond Hockey Club support player development beyond skills?\r\nThe club focuses on holistic development including education, health, and character building alongside hockey skills, emphasizing mental toughness and resilience.\r\n\r\nWhat is the communication method for schedule changes?","metadata":{"source":"new.txt","loc":{"lines":{"from":352,"to":358}}}}],["60",{"pageContent":"Communication methods for updates and schedule changes are not specified. This would likely be covered when you join the club.\r\n\r\nCan I purchase Pond Hockey Club merchandise?\r\nMerchandise availability is not mentioned on the website. Contact the club to inquire about team gear or branded items.\r\n\r\nWhat is the club's philosophy on competition?","metadata":{"source":"new.txt","loc":{"lines":{"from":359,"to":364}}}}],["61",{"pageContent":"What is the club's philosophy on competition?\r\nWhile the focus is on elite skill development and building competitive excellence, specific competition philosophy details should be discussed with the club directly.\r\n\r\nHow does Pond Hockey Club measure success?\r\nSuccess is measured through measurable skill progress, character development, mental toughness growth, and each player knowing where they stand and where they're headed.\r\n\r\nWhat happens after my trial class?","metadata":{"source":"new.txt","loc":{"lines":{"from":364,"to":370}}}}],["62",{"pageContent":"What happens after my trial class?\r\nAfter your trial class, you can decide whether to select a membership plan that fits your goals and schedule. Staff will help guide you through membership options.\r\n\r\nIs there an orientation for new members?\r\nNew member orientation processes are not detailed on the website. This would likely be explained when you join or during your trial class.\r\n\r\nWhat is the best age to start at Pond Hockey Club?","metadata":{"source":"new.txt","loc":{"lines":{"from":370,"to":376}}}}],["63",{"pageContent":"Specific age recommendations are not provided. Since the club serves \"kids and teens,\" contact them to discuss the best starting age for your child.\r\n\r\nDoes Pond Hockey Club work with schools or organizations?\r\nPartnership or group program information is not available on the main website. Contact the club to inquire about organizational programs.\r\n\r\nWhat sets Pond Hockey Club coaches apart?","metadata":{"source":"new.txt","loc":{"lines":{"from":377,"to":382}}}}],["64",{"pageContent":"What sets Pond Hockey Club coaches apart?\r\nCoach expertise and qualifications are detailed on the Coaches page. The small group format (4-6 players) allows coaches to provide personalized attention and continuous feedback.\r\n\r\nCan international or out-of-state families join?\r\nEligibility for out-of-area families is not specified. Contact the club to discuss options for families not local to Briarcliff Manor, NY.\r\n\r\nWhat is the environmental impact of synthetic ice?","metadata":{"source":"new.txt","loc":{"lines":{"from":382,"to":388}}}}],["65",{"pageContent":"Environmental aspects of synthetic ice are not discussed on the website. Contact the club if you'd like information about their facility's sustainability.\r\n\r\nHow does Pond Hockey Club stay current with hockey training methods?\r\nSpecific continuing education or training method updates are not detailed. Information about coaching expertise is available on the Coaches page.\r\n\r\nIs there a community or team aspect to training?","metadata":{"source":"new.txt","loc":{"lines":{"from":389,"to":394}}}}],["66",{"pageContent":"Is there a community or team aspect to training?\r\nWhile training is in small groups (4-6 players), the broader community aspects are not detailed. The club emphasizes individual development within a supportive environment.\r\n\r\nWhat is the long-term player development pathway?\r\nLong-term development pathways are not explicitly outlined on the website. The focus is on building elite skills and well-rounded athletes. Discuss specific goals with the club.","metadata":{"source":"new.txt","loc":{"lines":{"from":394,"to":398}}}}],["67",{"pageContent":"Can advanced players benefit from Pond Hockey Club?\r\nYes, the club focuses on elite training and continuous improvement. The high-repetition model and personalized attention benefit players at all levels looking to elevate their game.","metadata":{"source":"new.txt","loc":{"lines":{"from":400,"to":401}}}}],["68",{"pageContent":"Membership costs $50 per month.\r\nAnnual membership costs $500.","metadata":{"source":"pricing.txt","loc":{"lines":{"from":1,"to":2}}}}]]